app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages"
---
  def chat
    @messages = Message.all

INSERT INTO "messages" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "asd "], ["created_at", Fri, 07 Nov 2014 13:56:09 UTC +00:00], ["updated_at", Fri, 07 Nov 2014 13:56:09 UTC +00:00], ["user_id", 1]]
---
  def create
    @message = Message.new
    @message.content = message_params[:content]
    @message.user = current_user
    @message.save!