app/controllers/rides_controller.rb

  def create
      ride = Ride.create(start: params[:ride][:ride_start],
                         destination: params[:ride][:destination],
                         start_time: DateTime.strptime(params[:ride][:start_time], '%m/%d/%Y %I:%M %p'),
                         end_time: DateTime.strptime(params[:ride][:end_time], '%m/%d/%Y %I:%M %p'),
                         comment: params[:ride][:comment])
      ride.passengers << current_user
      ride.passenger_rides.find_by_passenger_id(current_user.id).update_attributes!(confirmed: "true")

    if ride.matches.any? then
---
INSERT INTO "rides" ("comment", "created_at", "destination", "end_time", "start", "start_time", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "passenger_rides".* FROM "passenger_rides" WHERE "passenger_rides"."ride_id" = $1 AND "passenger_rides"."passenger_id" = 3 LIMIT 1  [["ride_id", 6]]
UPDATE "passenger_rides" SET "confirmed" = $1, "updated_at" = $2 WHERE "passenger_rides"."id" = 4  [["confirmed", true], ["updated_at", Sun, 23 Nov 2014 23:36:09 UTC +00:00]]
SELECT COUNT(*) FROM "rides" WHERE (lower(start) like 'depauw' AND lower(destination) like 'indy' AND id != 6) AND (start_time between '2014-11-24 18:35:00.000000' and '2014-11-25 18:35:00.000000' or end_time between '2014-11-24 18:35:00.000000' and '2014-11-25 18:35:00.000000')