app/controllers/users_controller.rb

  def hop_on
    @ride = Ride.find_by_id(params[:ride])
    current_user.hop_on!(@ride)
    @driver = User.find_by_id(@ride.driver_id)
---
SELECT "rides".* FROM "rides" WHERE "rides"."id" = 3 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 2 ORDER BY "users"."id" ASC LIMIT 1

  def cancel
    @ride = Ride.find_by_id(params[:ride])
---
SELECT "rides".* FROM "rides" WHERE "rides"."id" = 3 LIMIT 1

  def accept
    @ride = current_user.fares.find_by_id(params[:ride])
    @rider = User.find_by_id(params[:passenger])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1

  def switch_mode
    if params[:driver] == "true" then
      session[:driver] = "false"
      current_user.update_attributes!(driver: false)
---
UPDATE "users" SET "driver" = $1 WHERE "users"."id" = 1  [["driver", false]]

  def pay
    amount = session["response"]["data"]["payment"]["amount"]
    @ride = Ride.find_by_id(session["ride"])
---
SELECT "rides".* FROM "rides" WHERE "rides"."id" = 5 LIMIT 1