app/controllers/welcome_controller.rb

SELECT "rides".* FROM "rides" WHERE (end_time >= '2014-09-30 23:52:19.595826')
SELECT "messages".* FROM "messages"
---
  def index
    if params[:ride] then
      @all_rides = Ride.find_by_id(params[:ride]).matches
    else
      @all_rides = Ride.current
    end
    #include chatbox to frontpage
    @messages = Message.all